{
  "releases": [
    {
      "version": "3.4.0",
      "date": "2026-01-09",
      "title": "Map & Venue Navigation Polish",
      "description": "Smoother exploration across the venue map and network graph. Fixed several navigation quirks that made it harder to jump between artists and venues, plus cleaned up the map's visual clutter so you can focus on the places that matter most.",
      "route": "/?scene=venues",
      "highlights": []
    },
    {
      "version": "3.3.0",
      "date": "2026-01-08",
      "title": "Connected Experience",
      "description": "Navigate seamlessly between scenes by clicking venue names anywhere in the app. When exploring an artist's concert history, tap any venue to jump straight to the Venues scene—automatically spotlighting both the venue and artist to show you their unique relationship. Map markers now display venue names for easier exploration.",
      "route": "/?scene=venues&venue=9-30-club&artist=depeche-mode",
      "highlights": [
        "Click venue names in artist details to explore venue-artist relationships",
        "Venue+artist combined deep linking focuses both nodes in force-directed graph",
        "\"Explore Venue\" buttons now use real links for better mobile UX",
        "Enhanced venue node label visibility in force-directed graph"
      ]
    },
    {
      "version": "3.2.0",
      "date": "2026-01-08",
      "title": "Mobile Artist Experience",
      "description": "Artist details now feel native on your phone. Tap any artist card to open a full-screen modal with tabbed navigation—swipe through your concert history, check upcoming tour dates, and pull up setlists with a tap. Swipe down or tap X to close, just like you'd expect.",
      "route": "/?scene=artists&artist=depeche-mode",
      "highlights": [
        "Full-screen modal replaces desktop gatefold on phones",
        "Tabbed navigation: Concert History, Upcoming Shows, Top Tracks",
        "Setlist overlay slides in from the right with swipe-to-dismiss",
        "Color-coded tabs with brand accents (violet, amber, Spotify green)"
      ]
    },
    {
      "version": "3.1.0",
      "date": "2026-01-07",
      "title": "iPad Touch Support",
      "description": "Explore your concert timeline naturally on iPad with touch-optimized interactions. Drag your finger across concert cards to preview them one by one, then tap to dive into any artist's full history—bringing the same fluid desktop experience to your tablet.",
      "route": "/?scene=timeline",
      "highlights": [
        "Drag across timeline cards to preview concerts with haptic feedback",
        "Tap any focused card to jump straight to the artist's gatefold",
        "Smooth touch detection distinguishes taps from swipes automatically"
      ]
    },
    {
      "version": "3.0.1",
      "date": "2026-01-06",
      "title": "Genre Enrichment & Artist Metadata",
      "description": "Your genre treemap now includes six more musical styles—from Neo Mellow's chill vibes to Political Hip Hop's conscious messages—giving you a more complete picture of your concert history's sonic diversity.",
      "route": "/?scene=genres",
      "highlights": []
    },
    {
      "version": "3.0.0",
      "date": "2026-01-06",
      "title": "Interactive Timeline Exploration & Genre Journey",
      "description": "Click any year on the timeline to explore every concert from that moment, then tap a card to dive into an artist's full story. Plus, watch your musical taste evolve through an animated genre timeline that shows how your concert history shaped your sound.",
      "route": "/?scene=timeline",
      "highlights": [
        "Interactive year cards - click any timeline dot to see all concerts from that year",
        "One-tap navigation from timeline to artist gatefold details",
        "Animated genre treemap with decade-by-decade musical evolution",
        "Genre drill-down to explore artists within each musical style"
      ]
    },
    {
      "version": "2.0.0",
      "date": "2026-01-05",
      "title": "Real-Time Tour Dates with Ticketmaster",
      "description": "Discover when your favorite artists are touring and buy tickets instantly with live Ticketmaster integration",
      "route": "/?scene=artists&artist=joe-jackson",
      "highlights": [
        "Live tour dates via Ticketmaster Discovery API (5,000 calls/day)",
        "\"ON TOUR\" badge appears instantly when artist has upcoming shows",
        "Direct ticket purchase links for every concert",
        "24-hour smart caching with automatic artist name fallback"
      ]
    },
    {
      "version": "1.8.0",
      "date": "2026-01-05",
      "title": "Developer Experience & Documentation Overhaul",
      "description": "Comprehensive documentation improvements and example templates for building your own concert archive",
      "route": "/",
      "highlights": [
        "Two-path getting started guide (Quick Start vs Your Own Data)",
        "Example CSV templates for concert data and venue status",
        "Unified data format specifications in data/README.md",
        "Privacy-first: Personal data files now gitignored with examples in repo"
      ]
    },
    {
      "version": "1.7.6",
      "date": "2026-01-04",
      "title": "Changelog Toast UX & Gatefold Refinements",
      "description": "Improved toast notifications and refined artist gatefold animations",
      "route": "/?scene=artists&artist=depeche-mode",
      "highlights": [
        "Optimized changelog toast UX with better positioning",
        "Improved artist gatefold image loading",
        "Fixed liner notes panel bleed-through during animations",
        "Enhanced visual polish across gatefold experience"
      ]
    },
    {
      "version": "1.7.5",
      "date": "2026-01-04",
      "title": "Mobile Touch Feedback & Haptics",
      "description": "Added haptic feedback for mobile interactions across the app",
      "route": "/?scene=artists&artist=duran-duran",
      "highlights": [
        "Haptic feedback on button taps and interactions",
        "Touch-optimized UI elements with visual feedback",
        "Improved mobile experience with tactile responses",
        "Tier 1 mobile polish complete"
      ]
    },
    {
      "version": "1.7.0",
      "date": "2026-01-04",
      "title": "Artist Search & Smart Sorting",
      "description": "Find any artist instantly with typeahead search, and see your most-seen artists first by default",
      "route": "/?scene=artists",
      "highlights": [
        "Typeahead search across all 248 artists",
        "Auto-scroll to artist and open gatefold",
        "Default sort by times seen (most frequent first)",
        "Smooth liner notes slide animations"
      ]
    },
    {
      "version": "1.5.1",
      "date": "2026-01-03",
      "title": "Venue Cross-Navigation",
      "description": "Click any venue on the map to navigate directly to its details in the Venues scene",
      "route": "/?scene=venues&venue=9-30-club",
      "highlights": [
        "Clickable \"Explore Venue →\" buttons in map popups",
        "Smooth scroll with spotlight animation",
        "Auto-expand venue with child artists"
      ]
    },
    {
      "version": "1.4.1",
      "date": "2026-01-03",
      "title": "Artist Photos in Gatefold",
      "description": "Open any artist's gatefold to see their photo alongside concert history",
      "route": "/?scene=artists&artist=social-distortion",
      "highlights": [
        "94 artists (54%) display photos",
        "Enriched metadata from Spotify, AudioDB, Last.fm",
        "Graceful fallback to gradient + initials"
      ]
    },
    {
      "version": "1.4.0",
      "date": "2026-01-03",
      "title": "Timeline Hover Preview",
      "description": "Hover over any year to see artist photos with subtle parallax effects",
      "route": "/?scene=timeline",
      "highlights": [
        "Artist imagery on hover",
        "Parallax mouse tracking",
        "Smooth fade-in animations"
      ]
    },
    {
      "version": "1.3.3",
      "date": "2026-01-02",
      "title": "Venue Photos on Map",
      "description": "Click any venue marker to see photos, legacy badges, and concert stats",
      "route": "/?scene=geography&venue=9-30-club",
      "highlights": [
        "96% of venues have photos (73/76)",
        "Lazy-loaded with skeleton shimmer",
        "Legacy badges for closed/demolished venues"
      ]
    },
    {
      "version": "1.3.2",
      "date": "2026-01-02",
      "title": "Google Places Integration",
      "description": "Venue photos powered by Google Places API with smart fallback hierarchy",
      "route": "/?scene=geography&venue=hollywood-palladium",
      "highlights": [
        "66 active venues with real photos",
        "Automatic fallbacks for legacy venues",
        "Manual curation support for historical photos"
      ]
    }
  ]
}
